# command+shifr+p удалить потом установит нажать
# GIT - рапределённая система контроля версий
# Это система для отслеживания и ведения истории изменения  файлов в вашем проекте

# Репозиторий (локальный/удалённый) - хранилище вашенго кода и истории его изменений

# GitHib - веб сайт для размещения git - гитрепозиториев в совместной разработкке
# команды Git:
# 1 git init -> она создает локальный репозиторий у вас на пк в той директории в которой была прописана команда

# 2 git status -> команда для провепки статуса

# 3 git add ->команда для добавления файлов в систему отслежтвания гита после этой команды
# изменнения начинают фиксироваться

# 4 git commit -m 'comment' -> команда для сохранения версии в локальном репозитории вместе
# с коментарием к изменениям

# 5 git remote add origin <url> ->  это команда для того чтобы установить связь локального
# репозитороия с удалённым в гитхабе

# 6 git push -> команда для отправки вашиз изменений в локальной репо в удалённый репо
    # git push origin main

#===============================================
'''
    1) git init (1 раз) # для создания локальной репо
    2) git add . #для отслеживания изменнений
    3) git commit -m 'comment'  # для фиксации версии проекто в локальном репо
    4) git push origin main # отправка всех версий на удалённый репо
'''